In [1]:
# Import pandas module and give it an alias 'pd'
import pandas as pd

In [2]:
"""
Read a CSV file into a DataFrame using the read_csv function.
Specify the file path using a raw string (r"") to avoid escape character issues.
Use 'parse_dates' option to parse the 'Date' column as dates.
Set the 'Date' column as the index of the DataFrame using 'index_col'.
"""
df = pd.read_csv(r"C:\Users\admin\OneDrive\Desktop\Datasets\retail_sales_dataset.csv", parse_dates=['Date'], index_col='Date')

"""
Set a display option to control the formatting of floating-point numbers.
The lambda function takes a floating-point number 'x' and formats it to two decimal places.
"""
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [3]:
# Return the first 5 rows
df.head(5)

,Transaction ID,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
Date,,,,,,,,
2023-11-24,1,CUST001,Male,34,Beauty,3,50,150
2023-02-27,2,CUST002,Female,26,Clothing,2,500,1000
2023-01-13,3,CUST003,Male,50,Electronics,1,30,30
2023-05-21,4,CUST004,Male,37,Clothing,1,500,500
2023-05-06,5,CUST005,Male,30,Beauty,2,50,100

In [4]:
# Return the last 5 rows
df.tail(5)

,Transaction ID,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
Date,,,,,,,,
2023-05-16,996,CUST996,Male,62,Clothing,1,50,50
2023-11-17,997,CUST997,Male,52,Beauty,3,30,90
2023-10-29,998,CUST998,Female,23,Beauty,4,25,100
2023-12-05,999,CUST999,Female,36,Electronics,3,50,150
2023-04-12,1000,CUST1000,Male,47,Electronics,4,30,120

In [5]:
# Assign the DataFrame 'df' to a new variable 'retail_sales'
retail_sales = df

# Use 'info()' method to display a concise summary of the DataFrame
retail_sales.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1000 entries, 2023-11-24 to 2023-04-12
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Customer ID       1000 non-null   object
 2   Gender            1000 non-null   object
 3   Age               1000 non-null   int64
 4   Product Category  1000 non-null   object
 5   Quantity          1000 non-null   int64
 6   Price per Unit    1000 non-null   int64
 7   Total Amount      1000 non-null   int64
dtypes: int64(5), object(3)
memory usage: 70.3+ KB

In [6]:
"""
Generate descriptive statistics of the DataFrame i.e. count, mean, standard deviation, minimum, 25th percentile,
median, 75th percentile and maximum values for each numeric column
"""
retail_sales.describe()

       Transaction ID     Age  Quantity  Price per Unit  Total Amount
count         1000.00 1000.00   1000.00         1000.00       1000.00
mean           500.50   41.39      2.51          179.89        456.00
std            288.82   13.68      1.13          189.68        560.00
min              1.00   18.00      1.00           25.00         25.00
25%            250.75   29.00      1.00           30.00         60.00
50%            500.50   42.00      3.00           50.00        135.00
75%            750.25   53.00      4.00          300.00        900.00
max           1000.00   64.00      4.00          500.00       2000.00

In [7]:
# Check for null values
retail_sales.isnull().sum()

Transaction ID      0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [8]:
# Use nunique() method to count the number of unique values in each column of the DataFrame
retail_sales.nunique()

Transaction ID      1000
Customer ID         1000
Gender                 2
Age                   47
Product Category       3
Quantity               4
Price per Unit         5
Total Amount          18
dtype: int64

### Customer age and gender influence on purchasing behavior

In [15]:
# Return the maximum age
retail_sales['Age'].max()

# Return the minimum age
retail_sales['Age'].min()

bins = [18, 30, 40, 50, 60, 70]
age_buckets = ['18-29', '30-39', '40-49', '50-59', '60+']
retail_sales['Age_buckets'] = pd.cut(df['Age'], bins, labels=age_buckets, include_lowest=True)
retail_sales.head(5)

,Transaction ID,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Age_buckets
Date,,,,,,,,,
2023-11-24,1,CUST001,Male,34,Beauty,3,50,150,30-39
2023-02-27,2,CUST002,Female,26,Clothing,2,500,1000,18-29
2023-01-13,3,CUST003,Male,50,Electronics,1,30,30,40-49
2023-05-21,4,CUST004,Male,37,Clothing,1,500,500,30-39
2023-05-06,5,CUST005,Male,30,Beauty,2,50,100,18-29

In [17]:
# Customer age purchasing behavior
retail_sales.groupby('Age_buckets')[['Quantity', 'Total Amount']].sum().sort_values(by= 'Total Amount', ascending=False)

             Quantity  Total Amount
Age_buckets
18-29             685        132945
50-59             552        100085
30-39             501         95950
40-49             551         93795
60+               225         33225

In [22]:
# Customer gender purchasing behavior
retail_sales.groupby('Gender')[['Quantity', 'Total Amount']].sum()

        Quantity  Total Amount
Gender
Female      1298        232840
Male        1216        223160

### Sales patterns across different time periods

In [22]:
yearly_sales = retail_sales['Total Amount'].resample('Y').sum()
yearly_sales

Date
2023-12-31    454470
2024-12-31      1530
Freq: A-DEC, Name: Total Amount, dtype: int64

In [24]:
quarterly_sales = retail_sales['Total Amount'].resample('Q').sum()
quarterly_sales

Date
2023-03-31    108500
2023-06-30    123735
2023-09-30     96045
2023-12-31    126190
2024-03-31      1530
Freq: Q-DEC, Name: Total Amount, dtype: int64

In [33]:
retail_sales['Total Amount'].resample('M').sum()

Date
2023-01-31    35450
2023-02-28    44060
2023-03-31    28990
2023-04-30    33870
2023-05-31    53150
2023-06-30    36715
2023-07-31    35465
2023-08-31    36960
2023-09-30    23620
2023-10-31    46580
2023-11-30    34920
2023-12-31    44690
2024-01-31     1530
Freq: M, Name: Total Amount, dtype: int64

#### Sales distribution across differennt product categories

In [27]:
retail_sales.groupby('Product Category')[['Quantity', 'Total Amount']].sum()

                  Quantity  Total Amount
Product Category
Beauty                 771        143515
Clothing               894        155580
Electronics            849        156905

#### Relationships between age, spending habits and product preference

In [32]:
retail_sales.groupby(['Age_buckets', 'Product Category'], as_index=False)[['Quantity', 'Total Amount']].sum()

   Age_buckets Product Category  Quantity  Total Amount
0        18-29           Beauty       246         45710
1        18-29         Clothing       224         48670
2        18-29      Electronics       215         38565
3        30-39           Beauty       149         32825
4        30-39         Clothing       179         31250
5        30-39      Electronics       173         31875
6        40-49           Beauty       167         33095
7        40-49         Clothing       207         29540
8        40-49      Electronics       177         31160
9        50-59           Beauty       154         26835
10       50-59         Clothing       201         34990
11       50-59      Electronics       197         38260
12         60+           Beauty        55          5050
13         60+         Clothing        83         11130
14         60+      Electronics        87         17045